In [6]:
# PANDAS 패키지 불러오기
import pandas as pd
 
# CSV 파일을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_csv("./dataset/missingValue.csv")

# 컬럼해더 재정의
#customerData.columns = ['CUSTID2','AVGPRICE','EMI','DEVICECOUNT','PRODUCTAGE','CUSTTYPE']

#컬럼 재정의(대문자로 바꾸는 방법)
#customerData.columns = [x.upper() for x in customerData.columns]
customerData.head()

# 데이터 VIEW
    
# CSV 파일로 저장
# customerData.to_csv("../dataset/customerdata_out.csv", index=False)
# customerData.head()

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01  PRODUCT1     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

### 컬럼별 결측값 개수확인하기

In [25]:
customerData.isnull().sum()

regionid       0
product        0
week           0
qty            2
target         2
NaN_cnt        0
Notnull_cnt    0
dtype: int64

In [27]:
customerData['qty'].isnull().sum()

2

In [28]:
customerData.notnull().sum()

regionid       4
product        4
week           4
qty            2
target         2
NaN_cnt        4
Notnull_cnt    4
dtype: int64

In [9]:
customerData['NaN_cnt']= customerData.isnull().sum(1)
customerData.head()

  regionid   product  week  qty  target  NaN_cnt
0      A01  PRODUCT1     1  NaN    20.0        1
1      A01  PRODUCT1     2  2.0     NaN        1
2      A01  PRODUCT1     3  NaN    10.0        1
3      A01  PRODUCT1     3  4.0     NaN        1

In [11]:
customerData['Notnull_cnt']= customerData.notnull().sum(1)
customerData.head()

  regionid   product  week  qty  target  NaN_cnt  Notnull_cnt
0      A01  PRODUCT1     1  NaN    20.0        1            6
1      A01  PRODUCT1     2  2.0     NaN        1            6
2      A01  PRODUCT1     3  NaN    10.0        1            6
3      A01  PRODUCT1     3  4.0     NaN        1            6

In [12]:
customerData.fillna(0)
#inplace는 그 값으로 계속 유지시킬것인지 True가 아니면 다시 원래로 돌아옴
#customerData.fillna(0, inplace=True)

  regionid   product  week  qty  target  NaN_cnt  Notnull_cnt
0      A01  PRODUCT1     1  0.0    20.0        1            6
1      A01  PRODUCT1     2  2.0     0.0        1            6
2      A01  PRODUCT1     3  0.0    10.0        1            6
3      A01  PRODUCT1     3  4.0     0.0        1            6

In [18]:
customerData.fillna(method="ffill")
#ffill : 위에 있는 값으로 채운다
#bfill : 밑에 있는 값으로 채운다

  regionid   product  week  qty  target  NaN_cnt  Notnull_cnt
0      A01  PRODUCT1     1  NaN    20.0        1            6
1      A01  PRODUCT1     2  2.0    20.0        1            6
2      A01  PRODUCT1     3  2.0    10.0        1            6
3      A01  PRODUCT1     3  4.0    10.0        1            6

In [19]:
customerData

  regionid   product  week  qty  target  NaN_cnt  Notnull_cnt
0      A01  PRODUCT1     1  NaN    20.0        1            6
1      A01  PRODUCT1     2  2.0     NaN        1            6
2      A01  PRODUCT1     3  NaN    10.0        1            6
3      A01  PRODUCT1     3  4.0     NaN        1            6

### 평균값으로 채우기

In [21]:
customerData.fillna(customerData.mean())
#그 컬럼의 전체의 평균으로 채워진다.

  regionid   product  week  qty  target  NaN_cnt  Notnull_cnt
0      A01  PRODUCT1     1  3.0    20.0        1            6
1      A01  PRODUCT1     2  2.0    15.0        1            6
2      A01  PRODUCT1     3  3.0    10.0        1            6
3      A01  PRODUCT1     3  4.0    15.0        1            6

In [23]:
customerData.fillna(customerData.mean()['qty':'target'])
#컬럼을 지정해서 그 컬럼부분만 평균을 구할 수 있음

  regionid   product  week  qty  target  NaN_cnt  Notnull_cnt
0      A01  PRODUCT1     1  3.0    20.0        1            6
1      A01  PRODUCT1     2  2.0    15.0        1            6
2      A01  PRODUCT1     3  3.0    10.0        1            6
3      A01  PRODUCT1     3  4.0    15.0        1            6

In [ ]:
customerData["new_qty"]